fj-feng/RF_Code/LoRa/SX126X/FP系列模组/STM32L4/FP20-C8/STM32L4_SX126X_FP20-C8_FSK(1.3OLED)/HARDWARE/SX126X/SX126X_Driver.c
    buf[0] = txBaseAddress;
    buf[1] = rxBaseAddress;
    SX126xWriteCommand( RADIO_SET_BUFFERBASEADDRESS, buf, 2 );
}
/**
  * @简介：
  * @参数：
  * @返回值：无
*/
void SX126xCalibrateImage( uint32_t freq )
{
    uint8_t calFreq[2];

    if( freq > 900000000 )
    {
        calFreq[0] = 0xE1;
        calFreq[1] = 0xE9;
    }
    else if( freq > 850000000 )
    {
        calFreq[0] = 0xD7;
        calFreq[1] = 0xD8;
    }
    else if( freq > 770000000 )
    {
        calFreq[0] = 0xC1;
        calFreq[1] = 0xC5;
    }
    else if( freq > 460000000 )
    {
        calFreq[0] = 0x75;
        calFreq[1] = 0x81;
    }
    else if( freq > 425000000 )
    {
        calFreq[0] = 0x6B;
        calFreq[1] = 0x6F;
    }
    SX126xWriteCommand( RADIO_CALIBRATEIMAGE, calFreq, 2 );
}
/**
  * @简介:频率设置
  * @参数：
  * @返回值：无
*/
tSX126xError SX126xSetRfFrequency(uint32_t frequency )
{
    if((G_LoRaConfig.LoRa_Freq > 920000000) || (G_LoRaConfig.LoRa_Freq < 410000000))
        return PARAMETER_INVALID;
    uint8_t buf[4];
    uint32_t freq = 0;
    SX126xSetStandby( STDBY_RC );
    SX126xCalibrateImage( G_LoRaConfig.LoRa_Freq );
    freq = ( uint32_t )( ( double )G_LoRaConfig.LoRa_Freq / ( double )FREQ_STEP );
    buf[0] = ( uint8_t )( ( freq >> 24 ) & 0xFF );
    buf[1] = ( uint8_t )( ( freq >> 16 ) & 0xFF );
    buf[2] = ( uint8_t )( ( freq >> 8 ) & 0xFF );
    buf[3] = ( uint8_t )( freq & 0xFF );
    SX126xWriteCommand( RADIO_SET_RFFREQUENCY, buf, 4);
		 return NORMAL;
}
/**
  * @简介:
  * @参数：
  * @返回值：无
*/
void SX126xSetDioIrqParams( uint16_t irqMask, uint16_t dio1Mask, uint16_t dio2Mask, uint16_t dio3Mask )
{
    uint8_t buf[8];
    buf[0] = ( uint8_t )( ( irqMask >> 8 ) & 0x00FF );
    buf[1] = ( uint8_t )( irqMask & 0x00FF );
    buf[2] = ( uint8_t )( ( dio1Mask >> 8 ) & 0x00FF );
    buf[3] = ( uint8_t )( dio1Mask & 0x00FF );
    buf[4] = ( uint8_t )( ( dio2Mask >> 8 ) & 0x00FF );
    buf[5] = ( uint8_t )( dio2Mask & 0x00FF );
    buf[6] = ( uint8_t )( ( dio3Mask >> 8 ) & 0x00FF );
    buf[7] = ( uint8_t )( dio3Mask & 0x00FF );
    SX126xWriteCommand( RADIO_CFG_DIOIRQ, buf, 8 );
}
/**
  * @简介:
  * @参数：
  * @返回值：无
*/
void SX126xSetPaConfig( uint8_t paDutyCycle, uint8_t hpMax, uint8_t deviceSel, uint8_t paLut )
{
    uint8_t buf[4];

    buf[0] = paDutyCycle;
    buf[1] = hpMax;
    buf[2] = deviceSel;
    buf[3] = paLut;
    SX126xWriteCommand( RADIO_SET_PACONFIG, buf, 4 );
}

/**
  * @简介：发射功率设置，该函数配置是结合硬件LSD4RF-2R717N30 考虑功耗及功率最优设置； 
  * @参数：Power输入值范围：-3~22；
  * @返回值:
  */

#if (VERSION==LSD4RF_2R717N30)
void SX126xSetTxParams( int8_t power, RadioRampTimes_t rampTime )
{
    uint8_t buf[2];
    if( power > 20 )
    {
        power = 20;
    }
    else if( power < -3 )
    {
        power = -3;
    }
		 switch(power)
    {
    case 20: 
     {
       power=22;
       SX126xSetPaConfig( 0x04, 0x07, 0x00, 0x01 );//实际输出20dBm左右
     }
        break;
    case 19:
     {
       power=22;
       SX126xSetPaConfig( 0x02, 0x07, 0x00, 0x01 );//实际输出19dBm左右
     }
        break;
		 case 18: 
     {
       power=22;
       SX126xSetPaConfig( 0x03, 0x05, 0x00, 0x01 );//实际输出18dBm左右
     }
    case 17: 
     {
       power=22;
       SX126xSetPaConfig( 0x02, 0x03, 0x00, 0x01 );//实际输出17dBm左右
     }
		  break;
    default:
		{
        power = power + 5;
        SX126xSetPaConfig( 0x02, 0x03, 0x00, 0x01 );//0~17dBm
    }
	 }
    SX126xWriteRegister( REG_OCP, 0x38 ); // current max 140mA for the whole device
    buf[0] = power;
    buf[1] = ( uint8_t )rampTime;
    SX126xWriteCommand( RADIO_SET_TXPARAMS, buf, 2 );
}

#elif (VERSION==LSD4RF_2R714N10)
/**
  * @简介：发射功率设置，该函数配置是结合硬糒SD4RF-2R714N10考虑功耗及功率最优设置； 
  * @参数：Power输入值范围：-3~22；
  * @返回值:
  */

void SX126xSetTxParams( int8_t power, RadioRampTimes_t rampTime )
{
	uint8_t buf[2];
    if( power >= 14 )
    {
        power = 15;
    }
    else if( power < -3 )
    {
        power = -3;
    }	 
    SX126xSetPaConfig( 0x04, 0x06, 0x00, 0x01 );
		
    SX126xWriteRegister( REG_OCP, 0x38 ); // current max 140mA for the whole device
    buf[0] = power;
    buf[1] = ( uint8_t )rampTime;
    SX126xWriteCommand( RADIO_SET_TXPARAMS, buf, 2 );
}

#else

/**
  * @简介：发射功率设置，该函数配置是结合硬件LSD4RF-2R717N40\LSD4RF-2R714N10\LSD4RF-2R722N20\考虑功耗及功率最优设置； 
  * @参数：Power输入值范围：-3~22；
  * @返回值:
  */
void SX126xSetTxParams( int8_t power, RadioRampTimes_t rampTime )
{
    uint8_t buf[2];
    if( power > 22 )
    {
        power = 22;
    }
    else if( power < -3 )
    {
        power = -3;
    }	 
    SX126xSetPaConfig( 0x04, 0x07, 0x00, 0x01 );
		
    SX126xWriteRegister( REG_OCP, 0x38 ); // current max 140mA for the whole device
    buf[0] = power;
    buf[1] = ( uint8_t )rampTime;
    SX126xWriteCommand( RADIO_SET_TXPARAMS, buf, 2 );
}

#endif


/**
  * @简介:
  * @参数：
  * @返回值：无
*/
void SX126xSetRfTxPower( int8_t power )
{
    SX126xSetTxParams( power, RADIO_RAMP_800_US );
}

/**
  * @简介:调制参数设置 ，SF、BW、CR、低数率优化设置
  * @参数：无
  * @返回值：无
*/
void SX126xSetLoraModulationParams(void)
{
    uint8_t n;

    uint8_t buf[8] = { 0x00, 0x00, 0x00, 0x00};
    n = 4;
    buf[0] = G_LoRaConfig.SpreadingFactor;
    buf[1] = G_LoRaConfig.BandWidth;
    buf[2] =  G_LoRaConfig.CodingRate;

		if(G_TsXms > 16.0)
    {
        buf[3] = LOWDATARATEOPTIMIZE_ON;
    }
    else
    {
        buf[3] = LOWDATARATEOPTIMIZE_OFF;
    }

	 if( ( G_LoRaConfig.SpreadingFactor == LORA_SF11 ) || ( G_LoRaConfig.SpreadingFactor == LORA_SF12 ) )
     {
			 //采集分辨率调准，主要解决低速率大数据包下丢包问题
        SX126xWriteRegister(0x889, SX126xReadRegister(0x889) & 0xfB);
     } 
    SX126xWriteCommand( RADIO_SET_MODULATIONPARAMS, buf, n );
}
/**
  * @简介:前导码、报头格式、PL、CRC等设置
  * @参数：无
  * @返回值：无
*/
void SX126xSetLoraPacketParams(void)
{
    //SX126xSetPacketType( PACKET_TYPE_LORA );
    uint8_t n;
    uint8_t buf[6] = { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};

