fj-feng/RF_Code/LoRa/SX126X/FP系列模组/STM32L4/FP20-C8/STM32L4_SX126X_FP20-C8_FSK(1.3OLED)/HARDWARE/SX126X/SX126X_Driver.c
    n = 6;
    buf[0] = (G_LoRaConfig.PreambleLength >> 8 ) & 0xFF;
    buf[1] = G_LoRaConfig.PreambleLength;
    buf[2] = G_LoRaConfig.HeaderType;
    buf[3] = G_LoRaConfig.PayloadLength;
    buf[4] = G_LoRaConfig.CrcMode;
    buf[5] = G_LoRaConfig.InvertIQ;
    SX126xWriteCommand( RADIO_SET_PACKETPARAMS, buf, n );
}
/**
  * @简介:
  * @参数：
  * @返回值：无
*/
void SX126xSetStopRxTimerOnPreambleDetect( bool enable )
{
    SX126xWriteCommand( RADIO_SET_STOPRXTIMERONPREAMBLE, ( uint8_t* )&enable, 1 );
}
/**
  * @简介:
  * @参数：
  * @返回值：无
*/
void SX126xSetLoRaSymbNumTimeout( uint8_t SymbNum )
{
    SX126xWriteCommand( RADIO_SET_LORASYMBTIMEOUT, &SymbNum, 1 );
}
/**
  * @简介：SX126X 配置频率检查判断
  * @参数：无
  * @返回值：true or false
  */
bool LoRaConfig_Check(void)
{
if((G_LoRaConfig.LoRa_Freq < 410000000) || (G_LoRaConfig.LoRa_Freq > 810000000))
        return false;

G_LoRaConfig.BandWidth = (RadioLoRaBandwidths_t)(G_LoRaConfig.BandWidth & 0x0F);
    if(G_LoRaConfig.BandWidth > 0x0A)
        return false;
  //计算BandWidth
    switch(G_LoRaConfig.BandWidth) {
    case  LORA_BW_500:
        G_BandWidthKHz = 500.0;
        break;
    case  LORA_BW_250:
        G_BandWidthKHz = 250.0;
        break;
    case  LORA_BW_125:
        G_BandWidthKHz = 125.0;
        break;
    case  LORA_BW_062:
        G_BandWidthKHz = 62.5;
        break;
    case  LORA_BW_041:
        G_BandWidthKHz = 41.67;
        break;
    case  LORA_BW_031:
        G_BandWidthKHz = 31.25;
        break;
    case  LORA_BW_020:
        G_BandWidthKHz = 20.83;
        break;
    case  LORA_BW_015:
        G_BandWidthKHz = 15.63;
        break;
    case  LORA_BW_010:
        G_BandWidthKHz = 10.42;
        break;
    case  LORA_BW_007:
        G_BandWidthKHz = 7.81;
        break;
    }
		
		 G_LoRaConfig.SpreadingFactor = (RadioLoRaSpreadingFactors_t)(G_LoRaConfig.SpreadingFactor & 0x0F);
    if((G_LoRaConfig.SpreadingFactor > LORA_SF12) || (G_LoRaConfig.SpreadingFactor < LORA_SF5))
        return false;
		
		//计算LoRa码元周期，单位ms
    G_TsXms = (2 << ((G_LoRaConfig.SpreadingFactor) - 1)) / G_BandWidthKHz;
		
		 G_LoRaConfig.CodingRate = (RadioLoRaCodingRates_t)(G_LoRaConfig.CodingRate & 0x07);
    if((G_LoRaConfig.CodingRate > LORA_CR_4_8) || (G_LoRaConfig.CodingRate < LORA_CR_4_5))
        return false;
    if(G_LoRaConfig.PowerCfig > 22)
        return false;
		 return true;
   
}
/**
* @简介:SX126X初始化
  * @参数：无
  * @返回值：tSX126xError   错误枚举内容
  */
tSX126xError SX126x_Lora_init(void)
{
    if(false == LoRaConfig_Check()) //如果输入参数错误
    {
      return PARAMETER_INVALID;  //报错输入
    }
		SX126X_SPI_Init();              //SPI初始化
    SX126X_InitIo();                // PAIO口初始化
		
		/*------------------------------------------------
        SX126X Lora模式初始化 --------  */
    SX126X_Reset();                 //复位RF
		SX126xWakeup( );
    SX126xSetStandby(STDBY_RC);    //切换到LoRamode，standby状态
		SX126xSetPacketType( PACKET_TYPE_LORA );  //设置成LORA模式
		
		 if (VERSION==LSD4RF_2R717N40)
		{
				SX126xSetDio3AsTcxoCtrl(TCXO_CTRL_2_7V, 6400);
		}
		
    /*------------------------------------------------
    SPI 验证                   */
    uint8_t test = 0;
    SX126xWriteRegister( REG_LR_PAYLOADLENGTH, 0x09);   //选一个用不到的寄存器来做验证
    test = SX126xReadRegister( REG_LR_PAYLOADLENGTH );
    if(test != 0x09)
        return SPI_READCHECK_WRONG;
		
    SX126xSetRegulatorMode( USE_DCDC );
		SX126xWriteRegister(REG_RX_GAIN, 0x96);//开启Rx Boosted gain,默认0x94不开启
    SX126xSetRfFrequency(G_LoRaConfig.LoRa_Freq);
    SX126xSetRfTxPower( G_LoRaConfig.PowerCfig );
		SX126xSetBufferBaseAddress( 0x00, 0x00 );
    SX126xSetLoraModulationParams( );   //SF、BW、CR、LOWDATARATEOPTIMIZE
    SX126xSetLoraPacketParams( );  //PreambleLength、HeaderType、PayloadLength、CrcMode、InvertIQ
    //SX126xSetDioIrqParams( IRQ_RADIO_ALL, IRQ_RADIO_ALL, IRQ_RADIO_NONE, IRQ_RADIO_NONE );
    return NORMAL;
}
/**
  * @简介:清标志
  * @参数：irq
  * @返回值：无
*/
void SX126xClearIrqStatus( uint16_t irq )
{
    uint8_t buf[2];

    buf[0] = ( uint8_t )( ( ( uint16_t )irq >> 8 ) & 0x00FF );
    buf[1] = ( uint8_t )( ( uint16_t )irq & 0x00FF );
    SX126xWriteCommand( RADIO_CLR_IRQSTATUS, buf, 2 );
}
/**
  * @简介:获取标志
  * @参数：无
  * @返回值：对应标志
*/
uint16_t SX126xGetIrqStatus( void )
{
    uint8_t irqStatus[2];

    SX126xReadCommand( RADIO_GET_IRQSTATUS, irqStatus, 2 );
    return ( irqStatus[0] << 8 ) | irqStatus[1];
}
/**
  * @简介:DIO2开关控制
  * @参数：enable
  * @返回值：无
*/
void SX126xSetDio2AsRfSwitchCtrl( uint8_t enable )
{
    SX126xWriteCommand( RADIO_SET_RFSWITCHMODE, &enable, 1 );
}
/**
  * @简介:DIO3 TCXO电源控制及功能开启
  * @参数：enable
  * @返回值：无
*/
void SX126xSetDio3AsTcxoCtrl( RadioTcxoCtrlVoltage_t tcxoVoltage, uint32_t timeout )
{
    uint8_t buf[4];

    buf[0] = tcxoVoltage & 0x07;
    buf[1] = ( uint8_t )( ( timeout >> 16 ) & 0xFF );
    buf[2] = ( uint8_t )( ( timeout >> 8 ) & 0xFF );
    buf[3] = ( uint8_t )( timeout & 0xFF );

    SX126xWriteCommand( RADIO_SET_TCXOMODE, buf, 4 );
}

/**
  * @简介:获取RSSI值
  * @参数：无
  * @返回值：RSSI值
*/
int8_t SX126xGetRssiInst( void )
{
    uint8_t buf[1];
    int8_t rssi = 0;

    SX126xReadCommand( RADIO_GET_RSSIINST, buf, 1 );
    rssi = -buf[0] >> 1;
    return rssi;
}
/**
  * @简介:
  * @参数：
  * @返回值：无
*/
void SX126xGetRxBufferStatus( uint8_t *payloadLength )  //, uint8_t *rxStartBufferPointer
{
    uint8_t status[2];

    SX126xReadCommand( RADIO_GET_RXBUFFERSTATUS, status, 2 );

    // In case of LORA fixed header, the payloadLength is obtained by reading
    // the register REG_LR_PAYLOADLENGTH
    if( ( SX126xReadRegister( REG_LR_PACKETPARAMS ) >> 7 == 1 ) )
    {
        *payloadLength = SX126xReadRegister( REG_LR_PAYLOADLENGTH );
    }
    else
    {
        *payloadLength = status[0];
    }
    // *rxStartBufferPointer = status[1];
}
/**
  * @简介:获取数据包RSSI及SNR值
  * @参数：
  * @返回值：无
*/
void SX126xGetPacketStatus( S_LoRaPara *pktStatus )
{
    uint8_t status[3];

    SX126xReadCommand( RADIO_GET_PACKETSTATUS, status, 3 );

    pktStatus->AvgPacket_RSSI = -status[0] >> 1;   //上一个数据包的RSSI平均值
    ( status[1] < 128 ) ? ( pktStatus->Packet_SNR = status[1] >> 2 ) : ( pktStatus->Packet_SNR = ( ( status[1] - 256 ) >> 2 ) );
    pktStatus->LastPacket_RSSI = -status[2] >> 1;
}

/**
  * @简介:进入发射
  * @参数：
  * @返回值：无
*/
void SX126xSetTx( uint32_t timeout )
{
    uint8_t buf[3];
    SX126xClearIrqStatus( IRQ_RADIO_ALL );
    buf[0] = ( uint8_t )( ( timeout >> 16 ) & 0xFF );
    buf[1] = ( uint8_t )( ( timeout >> 8 ) & 0xFF );
    buf[2] = ( uint8_t )( timeout & 0xFF );

    SX126xWriteCommand( RADIO_SET_TX, buf, 3 );
}
/**
  * @简介:进入接收
  * @参数：
  * @返回值：无
*/
void SX126xSetRx( uint32_t timeout )
{
    uint8_t buf[3];
    SX126xClearIrqStatus( IRQ_RADIO_ALL );
    buf[0] = ( uint8_t )( ( timeout >> 16 ) & 0xFF );
    buf[1] = ( uint8_t )( ( timeout >> 8 ) & 0xFF );
    buf[2] = ( uint8_t )( timeout & 0xFF );
    SX126xWriteCommand( RADIO_SET_RX, buf, 3 );
}

/**
  * @简介:发送数据
  * @参数：PL、size、timeout
  * @返回值：无
*/
void SX126xSendPayload( uint8_t *payload, uint8_t size, uint32_t timeout )
{
    SX126xWriteBuffer( 0x00, payload, size );
    SX126xSetTx( timeout );
}
/**
  * @简介:发送数据包
  * @参数：data
  * @返回值：无
*/
extern uint8_t communication_states;
void SX126X_TxPacket( uint8_t*data )
{
	  SX126xSetStandby(STDBY_RC);
	  SX126xSetRegulatorMode( USE_DCDC );
    SX126XWriteRxTx(true);
	  SX126xClearIrqStatus( IRQ_RADIO_ALL );
    SX126xSetDioIrqParams( IRQ_TX_DONE ,
                           IRQ_TX_DONE ,
                          IRQ_RADIO_NONE,
                           IRQ_RADIO_NONE );
                           //(p1,p2,p3,p4),P1:开哪个，P2:映射到DIO1，P3：映射到DIO2，P4映射到DIO3；
//    SX126xSetLoraModulationParams( );   //SF、BW、CR、LOWDATARATEOPTIMIZE
    SX126xSetLoraPacketParams( );  //PreambleLength、HeaderType、PayloadLength、CrcMode、InvertIQ
    SX126xSetBufferBaseAddress( 0x00, 0x00 );
    SX126xSendPayload( data, G_LoRaConfig.PayloadLength, 0x200000 );//Timeout disable, Tx Single mode
}
/**
  * @简介  :发送数据包
  * @参数  ：uint8_t*cbuf:发送数据指针
  * @返回值：无
  * @说明  ：接收完数据后DIO1从低电平变成高电平
*/
void LSD_RF_RXmode()
{
	 DIO1_EnableInterrupt();
   SX126X_StartRx();//进入接收模式，准备接收数据
}

/**
  * @简介  :发送数据包
  * @参数  ：uint8_t*cbuf:发送数据指针
  * @返回值：无
  * @说明  ：数据发送完成后DIO1从低电平变成高电平，每次调用次函数，会自动现将DIO1变为低电平，等待高电平
*/
void LSD_RF_SendPacket(uint8_t*cbuf)
{
   unsigned long int j=16777215;                   //超时用，用户需要根据实际情况来调整
	 DIO1_DisableInterrupt();
   SX126X_TxPacket(cbuf );
   while((DIO1_GetState()== GPIO_PIN_RESET)&&j)j--;  //等待DIO1电平为高
	 __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_1);                                   
}

/**
  * @简介:进入接收
  * @参数：无
  * @返回值：无
*/
void SX126X_StartRx( void )
{
    SX126xSetStandby(STDBY_RC);
	  SX126xSetRegulatorMode( USE_DCDC );
    SX126XWriteRxTx(false);
	  SX126xClearIrqStatus( IRQ_RADIO_ALL );
    SX126xSetDioIrqParams( IRQ_RX_DONE|IRQ_CRC_ERROR, 
                           IRQ_RX_DONE,
                           IRQ_RADIO_NONE,
                           IRQ_RADIO_NONE );  //打开RX、CRC中断，映射RX中断到DIO1；
	
	  SX126xSetStopRxTimerOnPreambleDetect( false );
    SX126xSetLoRaSymbNumTimeout(0);
//    SX126xSetLoraModulationParams( );   //SF、BW、CR、LOWDATARATEOPTIMIZE设置
//    SX126xSetLoraPacketParams( );  //PreambleLength、HeaderType、PayloadLength、CrcMode、InvertIQ设置
    SX126xSetBufferBaseAddress( 0x00, 0x00 );
    SX126xSetRx( 0xffffff ); // Rx Continuout
}
/**
  * @简介:获取数据
  * @参数：buffer，size
  * @返回值：无
*/
void SX126xGetPayload( uint8_t *buffer, uint8_t *size)
{
    SX126xReadBuffer( 0x00, buffer, *size );
}

/**
  * @简介：RF接收数据包
  * @参数：uint8_t*cbuf接收数组指针
  * @返回值：无
  */
void SX126X_RxPacket(uint8_t*cbuf)
{

    SX126xGetPacketStatus(&G_LoRaPara);//收到一包数据包后，返回SNR、RSSI等各种信息
	  SX126xClearIrqStatus( IRQ_RADIO_ALL );
    if( G_LoRaConfig.HeaderType == LORA_PACKET_EXPLICIT ) {
        //有头那么从寄存器中读，否则按照G_LoRaConfig设置长度读取FIFO
        SX126xGetRxBufferStatus(&G_LoRaConfig.PayloadLength);
    }
    SX126xGetPayload(cbuf, &G_LoRaConfig.PayloadLength);

