fj-feng/RF_Code/LoRa/SX126X/FP系列模组/STM32L4/FP20-C8/STM32L4_SX126X_FP20-C8_FSK(1.3OLED)/HARDWARE/SX126X/SX126X_Driver.c
}

/**
  * @简介：WOR初始化
  * @参数：无
  * @返回值：无
  */
void SX126xSetCadParams( RadioLoRaCadSymbols_t cadSymbolNum, uint8_t cadDetPeak, uint8_t cadDetMin, RadioCadExitModes_t cadExitMode, uint32_t cadTimeout )
{
    uint8_t buf[7];

    buf[0] = ( uint8_t )cadSymbolNum;
    buf[1] = cadDetPeak;
    buf[2] = cadDetMin;
    buf[3] = ( uint8_t )cadExitMode;
    buf[4] = ( uint8_t )( ( cadTimeout >> 16 ) & 0xFF );
    buf[5] = ( uint8_t )( ( cadTimeout >> 8 ) & 0xFF );
    buf[6] = ( uint8_t )( cadTimeout & 0xFF );
    SX126xWriteCommand( RADIO_SET_CADPARAMS, buf, 5 );
}
/**
  * @简介：SX126X 进CAD
  * @参数：无
  * @返回值：无
  */
void SX126xSetCad( void )
{
    SX126xWriteCommand( RADIO_SET_CAD, 0, 0 );
}
/**
  * @简介：SX126X CAD初始化
  * @参数：无
  * @返回值：无
  */

/*************************Best CAD Setting****************************/
/*  SF      cadDetMin    cadDetPeak     cadSymbolNum                 */  
/*  SF7       10             22            2 symbol                  */ 
/*  SF8       10             22            2 symbol                  */ 
/*  SF9       10             23            4 symbol                  */ 
/*  SF10      10             24            4 symbol                  */ 
/*  SF11      10             25            4 symbol                  */ 
/*  SF12      10             26            4 symbol                  */ 
/*********************************************************************/
void SX126X_CADinit(void)
{
  SX126xSetStandby(STDBY_RC);
	SX126xSetPacketType( PACKET_TYPE_LORA );  //设置成LORA模式
	SX126xSetRegulatorMode( USE_DCDC );
	SX126xSetCadParams( LORA_CAD_04_SYMBOL, 22, 10, LORA_CAD_ONLY, 0xff );//
	SX126XWriteRxTx(false);
	SX126xClearIrqStatus( IRQ_RADIO_ALL ); //clear flags
	SX126xSetDioIrqParams( IRQ_CAD_DONE|IRQ_CAD_ACTIVITY_DETECTED,
                           IRQ_CAD_DONE ,
                           IRQ_RADIO_NONE,
	                         IRQ_RADIO_NONE );
													 //(p1,p2,p3,p4),P1:开哪个，P2:映射到DIO1，P3：映射到DIO2，P4映射到DIO3；
}
/**
  * @简介：WOR初始化
  * @参数：无
  * @返回值：无
  */
void SX126X_WORInit(void)
{
    SX126X_CADinit();        //CAD功能初始化
}
/**
  * @简介：SX126X 启动CAD，采样信道情况一次   采样时间约为(2^SF+32)/BW
  * @参数：无
  * @返回值：无
  */
void SX126X_CAD_Sample(void)
{
	  SX126xSetStandby(STDBY_RC);
    SX126xSetCad();
}
/**
  * @简介：执行WOR操作
  * @参数：uint8_t cclen  0：进入睡眠;1：进入CAD检测模式
  * @返回值：无
  */
void SX126X_WOR_Execute(uint8_t cclen)
{
    switch(cclen)
    {
    case 0:   //启动睡眠
    {
        SX126xClearIrqStatus( IRQ_RADIO_ALL ); //clear flags
			  SX126xSetStandby(STDBY_RC);
        SX126xSleep();  //进入睡眠模式
    }
    break;
    case 1:   //进入CAD检测模式
    {
        SX126X_CAD_Sample();     //启动CAD一次
    }
    break;
    default:
        break;
    }
}


/**
  * @简介：WOR到RX
  * @参数：无
  * @返回值：无
  */
void SX126X_WOR_Exit(void)
{
    SX126xSetStandby(STDBY_RC);
  	SX126xSetPacketType( PACKET_TYPE_LORA );  //设置成LORA模式
  	SX126xSetRegulatorMode( USE_DCDC );
	  SX126XWriteRxTx(false);
	  SX126xClearIrqStatus( IRQ_RADIO_ALL );
    SX126xSetDioIrqParams( IRQ_RX_DONE|IRQ_CRC_ERROR, 
                           IRQ_RX_DONE,
                           IRQ_RADIO_NONE,
                           IRQ_RADIO_NONE );  //打开RX、CRC中断，映射RX中断到DIO1；
	  SX126xSetStopRxTimerOnPreambleDetect( false );
    SX126xSetLoRaSymbNumTimeout(0);
	  G_LoRaConfig.PreambleLength=0xffff; //这里接收的前导码一定要等于或大于唤醒包时实际前导码长，所以设置成最大值
//	  SX126xSetLoraModulationParams( );   //SF、BW、CR、LOWDATARATEOPTIMIZE
    SX126xSetLoraPacketParams( );  //PreambleLength、HeaderType、PayloadLength、CrcMode、InvertIQ设置
    SX126xSetBufferBaseAddress( 0x00, 0x00 );
    SX126xSetRx( 0xffffff ); // Rx Continuout
}

/**
  * @简介：SX126X发送唤醒包
  * @参数：uint8_t*data：发送数据指针,前导长度
  * @返回值：无
  */
void SX126X_Awake(uint8_t*cbuf, uint16_t Preamble_Length)
{
	  SX126xSetStandby(STDBY_RC);
	  SX126xSetRegulatorMode( USE_DCDC );
    SX126XWriteRxTx(true);
	  SX126xClearIrqStatus( IRQ_RADIO_ALL ); //clear flags
	  SX126xSetDioIrqParams( IRQ_TX_DONE ,
                           IRQ_TX_DONE ,
                           IRQ_RADIO_NONE,
	                         IRQ_RADIO_NONE );
													 //(p1,p2,p3,p4),P1:开哪个，P2:映射到DIO1，P3：映射到DIO2，P4映射到DIO3；
	  G_LoRaConfig.PreambleLength=Preamble_Length;
	  SX126xSetLoraPacketParams( );//PreambleLength、HeaderType、PayloadLength、CrcMode、InvertIQ设置
    SX126xSetBufferBaseAddress( 0x00, 0x00 );
    SX126xSendPayload( cbuf, G_LoRaConfig.PayloadLength, 0x000000);//Timeout disable, Tx Single mode
}
